{
  "AboutComponent": {
    "title": "Sobre mim",
    "subtitle": "Um pouco sobre quem eu sou",
    "content": "Sou um Desenvolvedor Web fascinado por transformar ideias em soluções inovadoras e eficientes. Desde cedo, a tecnologia me fascina e me motiva a resolver problemas com criatividade e expertise.\n\nMinha paixão se traduz em interfaces web intuitivas e responsivas, construídas com React, Typescript e Docker, sempre priorizando as melhores práticas. Adoro integrar inteligência artificial, dados geográficos e APIs (Python/Node.js) para criar experiências únicas.\n\nSou proativo, autônomo e adoro desafios! Contribuo ativamente para o sucesso da equipe, comunicando-me de forma clara e empática. Acredito em ambientes colaborativos e na troca de conhecimento.\n\nA qualidade do código é fundamental para mim. Por isso, aplico testes automatizados e os princípios SOLID em cada projeto. Também sou fã do Figma e da Geotecnologia, além de ter familiaridade com PHP, Java e C#.\n\nMinhas conquistas incluem o 3º lugar na FECEG com um projeto web inovador, o reconhecimento como aluno destaque na ETEC, a criação de robôs para automatizar tarefas e a liderança na refatoração de uma aplicação Javascript para Typescript. Fui premiado 5 vezes como destaque na empresa, refletindo meu compromisso com a excelência.\n\nSe você busca um profissional resiliente, com espírito de equipe e focado em resultados, que está sempre em busca de novos desafios e aprendizados, conte comigo!"
  },
  "HeroComponent": {
    "title": "Olá",
    "presentation": "Meu nome é",
    "description": "Eu construo coisas para web."
  },
  "HomePage": {
    "header": {
      "title": "Projetos",
      "subtitle": "Coisas que eu construí até agora"
    }
  },
  "TechStackComponent": {
    "header": {
      "subtitle": "Tecnologias com quem tenho trabalhado recentemente",
      "title": "Minha stack de tecnologia"
    }
  },
  "ProjectsListComponent": {
    "viewCodeLink": "Código Fonte",
    "previewLink": "Visualizar",
    "more": "Mais"
  },
  "projects": {
    "githubBlog": "O Github Blog é um aplicativo desenvolvido durante o Ignite React Challenge 03 do RocketSeat. O objetivo é consumir a API do GitHub para listar publicações (issues) de um repositório, exibir detalhes de cada publicação e permitir a busca de postagens.",
    "igniteShop": "Uma aplicação de e-commerce desenvolvida. Recursos incluem navegação de produtos, funcionalidade de carrinho de compras e integração com pagamento Stripe. Teste o sistema de pagamento usando o número do cartão 4242 4242 4242 4242 com qualquer data de expiração futura.",
    "coffeeDelivery": "Coffee Delivery é uma aplicação fictícia de e-commerce para venda de café, onde os usuários podem selecionar cafés, adicionar ao carrinho, preencher endereço de entrega e escolher método de pagamento. Projeto desenvolvido como desafio para o Ignite da Rocketseat.",
    "moveit": "Moveit é uma aplicação gamificada projetada para ajudar aqueles que passam longas horas na frente do computador e frequentemente se esquecem de se exercitar.",
    "ignews": "Uma plataforma de blog com integração de pagamento Stripe para assinaturas. Você pode testar o sistema de pagamento usando o número do cartão de teste 4242 4242 4242 4242 com qualquer data de expiração futura."
  },
  "NavBarComponent": {
    "homeLink": "Início",
    "projectsLink": "Projetos",
    "contactLink": "Contato"
  },
  "ModeToggleComponent": {
    "toggle": "Trocar tema",
    "light": "Claro",
    "dark": "Escuro",
    "system": "Sistema"
  },
  "ContactPage": {
    "description": "Para qualquer dúvida, envie-me uma <link>mensagem!</link>"
  },
  "LocaleToggle": {
    "button": "Mudar linguagem",
    "locale": "{locale, select, en {🇺🇸 English} pt_br {🇧🇷 Brasil} other {Unknown}}"
  }
}
